#include<stdio.h>
#include<math.h>
#define I 4
#define J 5
int main()
{
    double M[I][J]={10, 6, 2, 0, 25, 5, 1, -2, 4, 14, 3, 5, 1, -1, 10, 0, 6, -2, 2, 8};
    double u21, u31, u41, u32, u42, u43, x1, x2, x3, x4, x11, x22, x33, x44;
    double V[I][J], V1[I][J], V2[I][J], k, h, h1;
    int i, j, p;
    for ( i = 0; i < I; i++)// Клонируем M на V
    {
        for ( j = 0; j < J; j++)
        {
            V[i][j]=M[i][j];           
        }
    }
    u21=M[1][0]/M[0][0];
    u31=M[2][0]/M[0][0];
    u41=M[3][0]/M[0][0];
    double U1[3]={u21, u31, u41};
    for ( p = 0, i = 1; i < I;p++, i++)// Преобразовываем матрицу к треугольному виду 1
    {
        for ( j = 0; j < J; j++) 
        {
            V[i][j]=M[i][j] - M[0][j]*U1[p];
        } 
    }
    u32=V[2][1]/V[1][1];
    u42=V[3][1]/V[1][1];
    double U2[2]={u32, u42};
    for ( i = 0; i < I; i++)// Клонируем V на V1
    {
        for ( j = 0; j < J; j++)
        {
           V1[i][j]=V[i][j]; 
        }
        
    }
    for ( p = 0, i = 2; i < I;p++, i++)// Преобразовываем матрицу к треугольному виду 2
    {
        for ( j = 1; j < J; j++) 
        {
            V1[i][j]=V[i][j] - V[1][j]*U2[p];
        } 
    }    
    u43=V1[3][2]/V1[2][2];
    double U3[1]={u43};
    for ( i = 0; i < I; i++)// Клонируем V1 на V2
    {
        for ( j = 0; j < J; j++)
        {
           V2[i][j]=V1[i][j]; 
        }
    }    
    for ( p = 0, i = 3; i < I;p++, i++)// Преобразовываем матрицу к треугольному виду 3
    {
        for ( j = 2; j < J; j++) 
        {
            V2[i][j]=V1[i][j] - V1[2][j]*U3[p];
        } 
    }    
    printf("\nM\n");
    for ( i = 0; i < I; i++)// Выводим M
    {
        for ( j = 0; j < J; j++) 
        {
            printf("%.0f ", M[i][j]);
        } 
        printf("\n");
    }
    // Обратный ход ＼(￣▽￣)／ шел 2 час ночи
    x1=V2[3][4]/V2[3][3];
    x2=(V2[2][4]-x1*V2[2][3])/(V2[2][2]);
    x3=(V2[1][4]-x1*V2[1][3]-x2*V2[1][2])/(V2[1][1]);
    x4=(V2[0][4]-x1*V2[0][3]-x2*V2[0][2]-x3*V2[0][1])/(V2[0][0]);
    printf("X4 = %f\nX3 = %f\nX2 = %f\nX1 = %f", x1, x2, x3, x4);
    // Проверка
    return 0;
}